{
  "field_794": "I've worked out the next steps in my life",
  "field_795": "I plan and organise my time to get my work done",
  "field_796": "I give a lot of attention to my career planning",
  "field_797": "I complete all my homework on time",
  "field_798": "No matter who you are, you can change your intelligence a lot",
  "field_799": "I use all my independent study time effectively",
  "field_800": "I test myself on important topics until I remember them",
  "field_801": "I have a positive view of myself",
  "field_802": "I am a hard working student",
  "field_803": "I am confident in my academic ability",
  "field_804": "I always meet deadlines",
  "field_805": "I spread out my revision, rather than cramming at the last minute.",
  "field_806": "I don't let a poor test/assessment result get me down for too long",
  "field_807": "I strive to achieve the goals I set for myself",
  "field_808": "I summarise important information in diagrams, tables or lists",
  "field_809": "I enjoy learning new things",
  "field_810": "I'm not happy unless my work is the best it can be",
  "field_811": "I take good notes in class which are useful for revision",
  "field_812": "When revising I mix different kinds of topics/subjects in one study session",
  "field_813": "I feel I can cope with the pressure at school/college/University",
  "field_814": "I work as hard as I can in most classes",
  "field_815": "My books/files are organised",
  "field_816": "When preparing for a test/exam I teach someone else the material.",
  "field_817": "I'm happy to ask questions in front of a group.",
  "field_818": "I use highlighting/colour coding for revision",
  "field_819": "Your intelligence is something about you that you can change very much",
  "field_820": "I like hearing feedback about how I can improve",
  "field_821": "I can control my nerves in tests/practical assessments.",
  "field_2317": "I understand why education is important for my future",
  "field_1816": "I have the support I need to achieve this year?",
  "field_1817": "I feel equipped to face the study and revision challenges this year?",
  "field_1818": "I am confident I will achieve my potential in my final exams?"
} 